<a href="https://colab.research.google.com/github/indrabna/PRAKTIKUM_DATMIN/blob/main/Tugas_Algo_Apriori_2109116082_Muhammad_Indra_Buana.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Algoritma Alpiori

In [3]:
df =pd.read_csv("train.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
# Statistic
# Mean-Meidan-Modus_Std

print("Mean Fare :", df["Fare"].mean())
print("Mean Fare :", df["Fare"].median())
print("Mean Fare :", df["Fare"].mode()) #-> outputnya dapat berupa tuple [0]
print("Mean Fare :", df["Fare"].std())  #-> outputnya dapat berupa tuple [0]

# coba tampilka Mean-Meidan-Variance dari age
# kalau variance gaboleh pake df.age.var()

Mean Fare : 32.204207968574636
Mean Fare : 14.4542
Mean Fare : 0    8.05
dtype: float64
Mean Fare : 49.6934285971809

In [7]:
# Korelasi 

# Covariance
# Seberapa besar persebarannya. Tapi ini perlu 2 varibel

# Contoh
print("Cov umur dan biaya tiket :",df.Age.cov(df.Fare))

Cov umur dan biaya tiket : 73.84902981461926

In [9]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [ ]:
# Coba tampilkan kolerasi untuk age dan fare
# pakar rumus cov(age.fare)/ (std(age))*(std(fare))

print("Korelasi age dan fare :", cov()/(df["age"].std()*df["age"].std()))

In [10]:
# Handling missing value
# Untuk cek brapa banyak yang kososng
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
df.isna().sum()/ len(df)*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [14]:
df2 = df.drop(columns=["Cabin"])

In [15]:
df.isna().sum()/ len(df2)*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [16]:
# Gantikan kolom yang kosong
df2.Age= df2.Age.fillna(df2.Age.median())

In [18]:
df2.isna().sum()/ len(df2)*100

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.000000
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Embarked       0.224467
dtype: float64

##Tugas

In [33]:
df2.Embarked= df2.Embarked.fillna(df2.Embarked.mode()[0])

In [34]:
df2.isna().sum()/ len(df2)*100

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Embarked       0.0
dtype: float64